{
  "project_overview": "The Showcase website plays a pivotal role in Learningpool's sales pipeline, serving as a platform for exploring both off-the-shelf and bespoke e-learning content. Originally built on top of an LMS instance, the site was constrained by a complex interface, limited customization, and a rigid structure that made content exploration cumbersome for both customers and internal sales teams.\n\nThis redesign project aimed to reimagine Showcase as a purpose-built, customer-facing site with a simplified content structure, improved navigation, and enhanced visual presentation. By removing the LMS constraints, we could focus on delivering a clean, intuitive user experience designed around real sales workflows and content discovery needs.",
  
  "project_meta": {
    "timeline": "4 months",
    "people": ["Jane Doe", "John Smith"],
    "role": "Lead UX Designer"
  },

  "tools_and_technology": ["Figma", "Lookback.io", "Rails", "Hotjar"],

  "design_process": [
    {
      "stage": "Empathize",
      "summary": "Conducted collaborative workshops with the Showcase and Sales teams to identify frustrations and usability issues."
    },
    {
      "stage": "Define",
      "summary": "Mapped user pain points around navigation, onboarding complexity, and content discoverability."
    },
    {
      "stage": "Ideate",
      "summary": "Created lo-fi sketches and grouped content using a two-level structure of Collections and Lessons."
    },
    {
      "stage": "Prototype",
      "summary": "Built grayscale mockups and established a reusable component-based mini design system in Figma."
    },
    {
      "stage": "Test",
      "summary": "Conducted two remote usability group sessions using Lookback.io with sales representatives."
    }
  ],

  "user_research_and_insights": {
    "methods": ["Workshops", "Internal Interviews", "Surveys", "Usability Testing"],
    "insights": [
      "Sales teams struggled to onboard users due to content auto-assignment.",
      "Customers couldn't browse the full catalog and often needed direct links.",
      "The site lacked a visual identity consistent with the brand."
    ]
  },

  "challenge_and_solution": {
    "challenge": "The LMS-based Showcase website was confusing to navigate, difficult to administrate, and poorly aligned with the Learningpool brand. Users often dropped off or became overwhelmed due to automated onboarding and disjointed content discovery.",
    "solution": "We replaced the LMS with a standalone experience that focused on simplicity, branding, and structure. We introduced a two-tier content model (Collections > Lessons), image-led design elements, and a clearer IA to help both sales teams and customers engage with content seamlessly."
  },

  "visual_design_approach": {
    "description": "We aimed for a visually inviting, brand-consistent design with emphasis on discoverability and responsiveness. The layout focused on reducing friction and increasing scannability across devices.",
    "key_elements": [
      "Image-led content tiles with accessible scrims",
      "Mobile-first layout with optimized collection views",
      "Reusable Figma components and mini design system",
      "Grayscale wireframes evolving into hi-fi prototypes",
      "Tag-based filters and clear CTAs"
    ]
  },

  "testing_and_validation": {
    "methods": ["Group usability testing", "Lookback.io sessions", "Sales team feedback"],
    "findings": [
      "Users had trouble understanding the existing filter options",
      "The tag-only third level of content was not discoverable",
      "Participants responded well to the simplified layout and branded visuals"
    ]
  },

  "results_and_impact": {
    "changes_made": [
      "Introduced a third content level accessible via navigation rather than tags alone",
      "Redesigned filters to be immediately visible and more intuitive",
      "Added a new 'libraries' view for enhanced navigation",
      "Improved mobile interaction models, especially for collection tiles"
    ],
    "outcomes": [
      "15% increase in sales within 6 months post-launch",
      "50% reduction in time spent completing a sale",
      "Significant boost in cross-departmental collaboration with the UX team",
      "Project received internal recognition from C-Suite leadership",
      "Increased inbound requests from other departments for UX support"
    ]
  },

  "key_learnings": [
    "Iterating with real users was critical to success.",
    "Cross-department collaboration enhanced visibility and buy-in.",
    "Early usability testing helped guide key structural changes."
  ],
  
  "future_opportunities": [
    "Explore multilingual onboarding for international users.",
    "Introduce curated content lists that can be shared across teams.",
    "Implement user account personalization features based on usage patterns."
  ]
}
